# Задача 2
# Найдите сумму цифр трехзначного числа

a = int(input("Введите трехзначное число: "))
while a > 999 or a < 100:
    print("Введите трехзначное число:")
    a = int(input())
n1 = a // 100
n2 = a // 10 % 10
n3 = a % 10
amount = n1 + n2 + n3

print("Cумма цифр числа ", a, " = ", amount, "(", n1, "+", n2, "+", n3, ")", sep="")